using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace WebApplication1.Models
{
    public class DataBase
    {
        public static List<User> userList { get; set; }
        public static List<Category> categoryList { get; set; }
        public static List<Recipe> recipelist { get; set; }
        static DataBase()
        {
            userList = new List<User>()
            {
                new User()
                { Ucode="yaelmor2000",Uname="yael",Uadress="holon",Umail="yael@gmail.com",Upassword=111111 },
                  new User()
                { Ucode="0000000000",Uname="yael1",Uadress="holon",Umail="yael1@gmail.com",Upassword=987654321 }
            };
            categoryList = new List<Category>()
            {
               new Category()
               {Ccode=100,Cnane="עוגות",Cicon="assets/cake-icon.png"},
               new Category()
               { Ccode=110,Cnane="עוגיות",Cicon="assets/cookie-icon.png"},
               new Category()
               {Ccode=120,Cnane="קינוחים אישיים",Cicon="assets/dessert-icon.png"}
            };
            recipelist = new List<Recipe>()
            {
                      new Recipe()
                {
                    Rname ="עוגת גבינה בחושה עם פטל",
                    Rcategory =categoryList[0],
                    Rtimer =30,
                    Rlevel =2,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "150 גרם חמאת תנובה", "180 גרם גבינת נפוליאון בטעם טבעי", "250 גרם סוכר", "1/2מקל וניל", "3 ביצים", "200 גרם קמח תופח", "100 גרם פטל קפוא"},
                    Rpreparation =new List<string>(){"במיקסר עם וו גיטרה, להקציף את החמאה עם הסוכר וביצה אחת. אחרי 5 דקות להוסיף עוד ביצה ו 5 דקות לאחר מכן להוסיף את הביצה השלישית.", " להוסיף את הגבינה והווניל ולהמשיך להקציף יחד עוד דקה. מתקבלת תערובת בהירה מאוד ותפוחה.. להנמיך את פעולת המיקסר ולהוסיף את הקמח. להמשיך לעבד במיקסר רק עד איחוד התערובת – לא יותר מכך!", " לשמן תבנית אינגליש קייק, להעביר אליה חצי מהתערובת. לפזר באופן אקראי פטל ומעל לצקת את שארית התערובת.", " לאפות בתנור שחומם מראש לחום של 170 מעלות למשך כשעה (לבדוק את העוגה אחרי 45 דקות ולראות אם היא מוכנה)לצנן את העוגה היטב, לפדר מעליה אבקת סוכר, לקשט עם פטל."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cake8.jpg",
                    Rshow =true
                },
                    new Recipe()
                {
                    Rname ="קאפקייקס לימון ומרנג פירות יער",
                    Rcategory =categoryList[2],
                    Rtimer =45 ,
                    Rlevel =3,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "120גרם קמח לבן", "125גרם סוכר לבן","3גרם או 1/2כפית אבקת אפייה", "3גרם או 1/2כפית אבקת סודה לשתייה","1קורט מלח דק", "1ביצה L", "1גרידת לימון בינוני","30גרם או 2כפות מיץ לימון","120גרם שמן קנולה","150גרם חלב 3%","2טיפות צבע מאכל צהוב"},
                    Rpreparation =new List<string>(){ "מחממים תנור לחום של 165 מעלות.", "במיקסר עם וו גיטרה מערבבים במהירות נמוכה-בינונית את הביצה, הסוכר והמלח עד שנוצרת תערובת בהירה. יש להיזהר לא להקציף מידי את התערובת.", "מנפים את הקמח, אבקת האפייה והסודה לשתייה בקערה. בקערה נוספת מערבבים את החלב, גרידת הלימון ומיץ הלימון ותמצית הלימון.", "מוסיפים למיקסר את השמן ומערבבים עד לאיחוד.", "מוסיפים 1/3 מתערובת היבשים למיקסר ולאחר מכן 1/2 מתערובת הנוזלים. מוודאים שהכל התערבב היטב. מומלץ לעבור עם לקקן על דפנות קערת המיקסר.", "ממשיכים להוסיף 1/3 מתערובת היבשים למיקסר, לאחר מכן את שאר תערובת הנוזלים ובסוף את שארית תערובת היבשים.", "מוסיפים 1-2 טיפות צבע מאכל צהוב לתערובת ומערבבים היטב.", "3גרם או 1/2כפית אבקת אפייה"},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/k1.jpeg",
                    Rshow =true
                },
                     new Recipe()
                {
                    Rname ="מעדן יוגורתות ותותים",
                    Rcategory =categoryList[2],
                    Rtimer =10,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "1/2סלסילה תותים", "2כפות לימונים", "4כפות אבקת סוכר", "1מיכל יוגורט 3%","1/2דף ג’לטין","קולי תות","תותים"},
                    Rpreparation =new List<string>(){ "טוחנים במעבד המזון את התותים עם הלימון ואבקת הסוכר למחית חלקה. טועמים ומוסיפים אבקת סוכר לפי הטעם.מוסיפים לקערה את היוגורט ומערבבים יחד.","מוסיפים את הג’לטין, מערבבים. מכניסים למיקרו ל-30 שניות ומערבבים היטב עד שכל הג’לטין נמס.", "מעבירים את תערובת היוגורט והתותים לכוסות הגשה. מכסים בניילון נצמד ומכניסים למקרר להתייצבות.", "לפני ההגשה מקשטים בחצאי תותים (אפשר גם לזלף מעט מהקולי תות) ומגישים."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/k2.jpg",
                    Rshow =true
                },
                      new Recipe()
                {
                    Rname ="קסטה עם שוקולד וגבינה",
                    Rcategory =categoryList[2],
                    Rtimer =40,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){  "500גרם פתי בר שוקולד", "2מיכלים שמנת מתוקה 38%", "1/2כוס חלב 3%", "500גרם גבינה לבנה 5%", "3כפות סוכר לבן", "1קופסה אינסטנט פודינג בטעם וניל", "2גביעי מו – ממרח על בסיס גבינה ושוקולד טרה"},
                    Rpreparation =new List<string>(){ "מקציפים יחד את כל חומרי המילוי (פרט לגבינת השוקולד מוו והביסקוויטים) עד לקבלת קרם יציב.", "מעבירים חצי מכמות הקרם לקערה נוספת, מוסיפים את גבינת השוקולד מוו, ומערבבים היטב.", "מניחים בתבנית ביסקוויטים על כל שטח הפנים ומשטחים מעליהם את קרם הווניל","מסדרים שכבה נוספת של ביסקוויטים ומשטחים מעליהם את קרם השוקולד.","מסדרים מעל שכבה נוספת של ביסקוויטים ומקפיאים למשך כשלוש שעות.","חותכים את העוגה למנות לפי צורת הביסקוויטים העליונים, כך שנוצרת לנו קסטה כפולה, ומגישים"},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/k3.jpg",
                    Rshow =true
                },
                    new Recipe()
                {
                    Rname =" קרמבו בסיס מרנג שווייצרי",
                    Rcategory =categoryList[2],
                    Rtimer =25,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "20עוגיות אוראו בינוניות","5חלבונים L","250גרם סוכר לבן","1קורט מלח דק","200גרם שוקולד מריר","2כפות שמן קנולה","1חופן סוכריות צבעוניות"},
                    Rpreparation =new List<string>(){ "שמים את החלבונים, הסוכר והמלח לקערת המיקסר המבשל עם וו בלון ומפעילים את התכנית “חימום עדין”. מבשלים את החלבונים תוך טריפה במהירות נמוכה עד שהסוכר נמס (בערך 65 מעלות).", "מעלים את המהירות ומקציפים את המסה במשך כ-8-9 דקות, או עד שמתקבלת מרנג יציב ומבריק עם פיקים חזקים שלא נופלים. מעבירים את המרנג לשקית זילוף עם צנטר חלק.", "מסדרים את העוגיות על קרש או תבנית. מזלפים מעל כל עוגייה תלולית מרנג גבוהה."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/k4.jpg",
                    Rshow =true
                },
                     new Recipe()
                {
                    Rname ="קרם מסקרפונה וקראמבל לוטוס",
                    Rcategory =categoryList[2],
                    Rtimer =15,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "1מיכל או 250מל שמנת מתוקה 38%","2כפות אבקת סוכר","2כפות גבינת מסקרפונה","2כפות ממרח לוטוס","80גרם עוגיות לוטוס","2כפות שקדים טחונים","25גרם חמאה רכה"},
                    Rpreparation =new List<string>(){ "מכינים את הקרם: מקציפים בקערת מיקסר שמנת מתוקה ואבקת סוכר לקצפת רכה. מוסיפים גבינת מסקרפונה וממרח לוטוס ומקציפים עוד כדקה, עד לקבלת קרם חלק.", "יוצקים את הקרם לכלי הגשה, מכסים בניילון נצמד ומעבירים למקרר לשעתיים לפחות", "מכינים את הקראמבל ומגישים: מרסקים במעבד מזון עוגיות לוטוס לתערובת פירורית.","מוסיפים אבקת שקדים וחמאה מומסת ומערבלים לתערובת אחידה, שמזכירה חול רטוב.","שומרים בכלי אטום במקרר עד ההגשה. מפזרים על הקרם ומגישים."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/k5.jpg",
                    Rshow =true
                },
                     new Recipe()
                {
                    Rname ="שוקו חם בניחוח תפוזים",
                    Rcategory =categoryList[2],
                    Rtimer =35,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "2כוסות חלב 3%","200גרם שוקולד מריר","1כף סוכר לבן","1כף גרידת תפוז","1כף ליקר תפוזים","2פרוסות תפוזים","4כפות סוכר לבן"},
                    Rpreparation =new List<string>(){ "מכינים את השוקו תפוז: מחממים את החלב עם גרידת התפוז עד לסף רתיחה.", "מעבירים את השוקולד לקערה. מוזגים על השוקולד את החלב החם, מחכים חצי דקה ומערבבים עד שכל השוקולד נמס. מכסים את הקערה בניילון נצמד ומניחים בצד ל-20 דקות.", "מכינים את הקישוט: מעבירים את הסוכר לקערה ומניחים בתוכה את פרוסות התפוז עד שהן מצופות לחלוטין בסוכר.","מחממים במיקרו או בבן מארי את קערת השוקו ומסננים את המשקה דרך מסננת צפופה לקנקן הגשה. מוסיפים את ליקר התפוזים ומערבבים. טועמים ומוסיפים סוכר אם צריך.","מוזגים לכוסות ומקשטים בפלחי תפוז מסוכרים."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/k6.jpg",
                    Rshow =true
                },
                          new Recipe()
                {
                    Rname ="פונדנט שוקולד וממרח קרמל",
                    Rcategory =categoryList[0],
                    Rtimer =30,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "200גרם שוקולד מריר","100גרם חמאה","2ביצים M","2חלמונים M","1/2כוס או 100גרם סוכר לבן","1/3כוס או 45גרם קמח לבן","6כפיות גדושות ממרח לוטוס"},
                    Rpreparation =new List<string>(){ "מחממים תנור לטמפרטורה של 200 מעלות ומשמנים תבניות שקעים חד פעמיות מאלומיניום.", "ממיסים שוקולד וחמאה במיקרוגל או באמבט מים חמים (באן מארי) ומערבבים לתערובת חלקה. מצננים 5 דקות.", "בינתיים טורפים ביצים וחלמונים בקערה גדולה. מוסיפים סוכר ומערבבים.","מוסיפים את תערובת השוקולד ומערבבים. מוסיפים קמח ומערבבים לתערובת חלקה.","יוצקים לתבנית שקעים עד שני שליש מגובהם. מוסיפים כפית גדושה של ממרח במרכז כל תערובת, ויוצקים את שאר תערובת השוקולד.","מניחים את תבנית השקעים על תבנית תנור כדי שיהיה יותר קל לחלץ מהתנור.","אופים 18-17 דקות, עד שהפונדנטים תפוחים ומבוקעים (בפנים הפונדנט נשאר נוזלי). ממתינים דקה-שתיים.","גוזרים את צידי התבניות החד פעמיות ומחלצים בזהירות את הפונדנטים. מניחים כל פונדנט על צלחת ומפזרים אבקת קקאו"},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/k7.jpg",
                    Rshow =true
                },
                      new Recipe()
                {
                    Rname ="מוס שוקולד בשני צבעים",
                    Rcategory =categoryList[2],
                    Rtimer =20,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "250גרם שוקולד לבן","250גרם שוקולד מריר","4מיכלים או 1ליטר שמנת מתוקה 38%","1מקל וניל בינוני","1/4כוס פניני שוקולד"},
                    Rpreparation =new List<string>(){ "על קרש חיתוך קוצצים את השוקולדים ומכניסים כל אחד לקערה נפרדת. ", "מכניסים חצי מכמות השמנת (500 מ”ל) לסיר ומביאים לסף רתיחה.", "שופכים כוס מהשמנת החמה על כל אחד מהשוקולדים, ממתינים כחצי דקה ומערבבים היטב לתערובת אחידה וחלקה. מכניסים למקרר ל-4 שעות או למשך הלילה מכוסה בניילון.","מוציאים את תערובת השוקולד המריר מהמקרר לתוך קערת מיקסר. מוסיפים כוס שמנת להקצפה, מערבבים היטב ומקציפים לקבלת קרם. יוצקים את הקרם לתחתית של כוסות הגשה, מניחים אותן באלכסון בתבנית מאפינס ומכניסים למקרר להתייצבות למשך שעה-שעתיים.","לאחר שהקרם התייצב, מכניסים לקערה את השוקולד הלבן עם גרגירים ממקל וניל וחצי כוס של שמנת ומקציפים ביחד לקרם יציב. יוצקים לתוך הכוסות מעל השוקולד המריר ומשאירים כ-4 שעות להתייצבות.","מקשטים מלמעלה בשבבי שוקולד או בפניני שוקולד ומגישים קר."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/k8.jpg",
                    Rshow =true
                },
                new Recipe()
                {
                    Rname ="עוגיות שוקולד צ'יפס",
                    Rcategory =categoryList[1],
                    Rtimer =10,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "2 ביצים", "2 כוסות קמח","1 כוס סוכר חום","1/2 כוס סוכר לבן","1 כוס שמן","1 כפית תמצית וניל","1 כפית סודה לשתיה","1 כפית מלח","2/3 כוס שוקולד צ'יפס"},
                    Rpreparation =new List<string>(){ " מערבבים את החומרים הרטובים ומוסיפים את היבשים. (ניתן להוסיף כף מים)", "מוסיפים את השוקולד צ'יפס ושוטחים בעזרת ידיים משומנות על תבנית תנור. אופים בתנור מחומם מראש ל-170 מעלות במשך 20 דקות עד להשחמה.", " מוציאים וחותכים לריבועים מיד כשהכול עדיין חם. מצנניםעד שמתקשה ואורזים בקופסה אטומה."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cookie1.jpg",
                    Rshow =true
                },
                 new Recipe()
                {
                    Rname ="עוגיות טחינה",
                    Rcategory =categoryList[1],
                    Rtimer =63,
                    Rlevel =5,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "60 גרם שקדים לא קלויים", "1/2 כוס קמח טפיוקה", "1/2 כפית קינמון", "1/4 כפית מלח", "1 כפית אבקת אפייה", "1/2 כוס סוכר חום", "1/4 כוס סוכר לבן", "1 כוס טחינה גולמית", "50 גרם חמאה רכה","1 ביצה"},
                    Rpreparation =new List<string>(){ "שמים במעבד זמון שקדים, קמח טפיוקה, תבלינים, אבקת אפיה וסוכרים ומעבדים עד שהשקדים טחונים דק דק. מוסיפים טחינה, חמאה וביצה ומעבדים לבצק אחיד.", " שמים את הפיסטוק הקצוץ בצלחת, מחממים תנור ל 170 מעלות ומרפדים תבנית בנייר אפיה. יוצרים כדורים קטנים בקוטר 2.5 סמ ומהדקים על צלחת הפיסטוק כך שהעוגיה תשתטח ותצופה מצד אחד בפיסטוק. מניחים בתבנית ואופים כ 12 דקות עד הזהבה. העוגיות רכות כשהן יוצאות מהתנור ומתייצבות לאחר צינון. מצננים ומגישים."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cookie2.jpg",
                    Rshow =true
                },
                  new Recipe()
                {
                    Rname ="עוגיות דבש ובוטנים מלוחים",
                    Rcategory =categoryList[1],
                    Rtimer =30,
                    Rlevel =2,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "100 גרם בוטנים מטוגנים (קנויים)", "200 גרם חמאת  חתוכה לקוביות", "¼ כוס (90 גרם) דבש", "75 + 25 גרם אבקת סוכר", "½1 כפיות תמצית וניל", "2 כוסות פחות 2 כפות (235 גרם) קמח", "2 כפות קורנפלור", "1 כפית אבקת אפייה", "¼ כפית סודה לשתייה"},
                    Rpreparation =new List<string>(){ " מחממים את התנור בתוכנית טורבו לחום של 160 מעלות. מכינים שתי תבניות אפייה שטוחות.", " מחממים את התנור בתוכנית טורבו לחום של 160 מעלות. מכינים שתי תבניות אפייה שטוחות.", "מעבירים את הבצק לקערה גדולה. מודדים כפות מתערובת (אני מודדת בכף קפיצית בקוטר 3 סמ או בכף מידה מהסט) ומגלגלים לכדורים חלקים.מסדרים את הכדורים בתבניות - משאירים רווח של 2 סמ בין כדור לכדור. מנפים על חלקם העליון של כדורי הבצק את אבקת הסוכר הנותרת.", "אופים את שתי התבניות יחד - תבנית אחת במדף השני ותבנית שנייה במדף הרביעי - במשך 12 דקות. מסובבים את התבניות ומחליפים מקומות. אופים במשך 5 דקות נוספות, עד שהעוגיות מקבלות גוון זהוב. מוציאים מהתנור ומצננים בתבנית. אורזים בקופסאות אטומות."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cookie3.jpg",
                    Rshow =true
                },
                   new Recipe()
                {
                    Rname ="מעמולים בטעם אגוזים",

                    Rcategory =categoryList[1],
                    Rtimer =20,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "350 גרם קמח תופח", "200 גרם חמאת תנובה רכה", "3 כפות סוכר", "1/2 מכל שמנת להקצפה 32% ", "150 גרם אגוזים קצוצים דק", "2 כפיות קינמון", "3 כפות סוכר", "1 כפית תמצית מי ורדים", "אבקת סוכר"},
                    Rpreparation =new List<string>(){ " מחממים תנור לחום בינוני.", "שמים בקערה את כל מרכיבי הבצק ולשים עד שמתקבל בצק אחיד. לאחר מכן, שמים בקערה אחרת את מרכיבי המלית ומערבבים היטב. ", "קורצים מהבצק 22 כדורים צרים, ויוצרים בכל כדור בצק גומה עמוקה אותה ממלאים במלית. סוגרים את הבצק ומגלגלים לכדור. לאחר מכן, צובטים את הכדור במצבט או במזלג בקצוות.","מניחים בתבנית את העוגיות במרווחים של 3 סמ בין כל אחת ואופים במשך 20 דקות עד הזהבה.","מוציאים מהתנור, מצננים ובוזקים מעל אבקת סוכר."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cookie4.jpg",
                    Rshow =true
                },
                 new Recipe()
                {
                    Rname ="חיתוכיות לוטוס",
                    Rcategory =categoryList[1],
                    Rtimer =20,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){  "2 כוסות (250 גרם) קמח", "½ כפית אבקת אפיה", "קורט מלח", "100 גרם אבקת סוכר", "50 גרם אגוזי פקאן", "150 גרם חמאת תנובה בטמפרטורת החדר, חתוכה לקוביות", "3-2 כפות מים קרים", "1 צנצנת (400 גרם) ממרח עוגיות לוטוס"},
                    Rpreparation =new List<string>(){ "מחממים את התנור לחום בינוני (180 מעלות). משמנים תבנית מלבנית 23x30 סמ, ומרפדים את תחתיתה ואת דופנותיה בנייר אפייה.", "מכינים את הבצק: מנפים קמח, אבקת אפייה, מלח ואבקת סוכר למכל של מעבד המזון. מוסיפים חצי מכמות הפקאנים ומפעילים בלחיצות על כפתור הפולסים כדי לרסק את האגוזים. מוסיפים את החמאה, ומעבדים בפולסים עד שנוצרים פירורי בצק כמעט אחידים בגודל בינוני - אם הפירורים עדינים מדי, אפשר להוסיף כף מהמים כדי לקבל פירורים גסים יותר. מורידים ¾ כוס פירורים לקערה קטנה ושומרים בצד. מוסיפים את המים לבצק שנותר במעבד המזון וממשיכים לעבד לבצק שמתאסף בגושים גדולים מסביב ללהבים. ", "משטחים את הבצק בשכבה אחידה בתבנית המוכנה. ודוקרים אותו במזלג לאורכו ולרוחבו. קוצצים דק את הפקאנים הנותרים, ומערבבים עם פירורי הבצק השמורים. מפזרים את הפירורים בתבנית קטנה. מניחים את התבנית המלבנית על רשת במדף האמצעי של התנור. מניחים את תבנית הפירורים במדף התחתון של התנור. אופים במשך 10 דקות. מוציאים את תבנית הפירורים מהתנור, וממשיכים לאפות את הבצק שבתבנית המלבנית במשך 7-5 דקות נוספות, עד שהבצק מזהיב קלות. מפרידים ומפוררים את הפירורים האפויים שבתבנית הקטנה בעזרת מזלג.", "מוציאים את בסיס הבצק האפוי מהתנור, ומכוונים את חום התנור לבינוני־נמוך (160 מעלות). מפזרים כפיות מלאות של ממרח הלוטוס על בסיס הבצק החם, ומשהים 3-2 דקות, כדי להניח לממרח להתרכך. מורחים את ממרח הלוטוס בשכבה אחידה על בסיס הבצק, וזורים עליו את פירורי הבצק והפקאנים. מחזירים את התבנית לתנור, ואופים במשך 15-12 דקות. מוציאים מהתנור ומצננים לגמרי (ביום חם כדאי להכניס את התבנית למקרר לכחצי שעה כדי להקל את החיתוך).", " חותכים את המאפה ל־24 מרובעים. משחררים בזהירות מנייר האפייה, ומסדרים במגש או בקופסה. מפרידים בין השכבות בנייר אפייה.  "},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cookie5.jpg",
                    Rshow =true
                },
                new Recipe()
                {
                    Rname ="אלפחורס",
                    Rcategory =categoryList[1],
                    Rtimer =40,
                    Rlevel =3,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "150 גרם חמאה  רכה", "4 כפות סוכר","2 ביצים", "1 כפית תמצית וניל", "2 כוסות קמח", "1 כוס קורנפלור", "2 כפיות אבקת אפיה", "1 כפית מלח", "ריבת חלב", "3/4 כוס שבבי קוקוס"},
                    Rpreparation =new List<string>(){ " בקערה של מיקסר או בעזרת מיקסר ידני, מניחים את החמאה והסוכר ומערבלים לתערובת תפוחה וקרמית. מוסיפים את הביצים ותמצית הוניל ומערבלים היטב. מניחים בצד.", "בקערה גדולה, מניחים את הקמח, קורנפלור, אבקת אפיה ומלח ומערבבים היטב. מוסיפים את תערובת הקמח לבלילה ומעבדים עד לבצק רך ואחיד. אם הבצק מתפורר אפשר להוסיף כמה טיפות חלב. עוטפים את הבנצק בניילון נצמד ומצננים במקרר כשעתיים.", "מחממים תנור ל-175 מעלות ומרפדים תבנית שטוחה בנייר אפיה.", "מחלקים את הבצק לשני חלקים. על גבי משטח מקומח, מרדדים חתיכת בצק למלבן בעובי 5 ממ.בעזרת חותכן עוגיות קורצים עיגולים בקוטר 5 סמ. חוזרים על הפעולה עם יתר הבצק. מעבירים לתבנית ואופים בתנור 8 דקות. העוגיות צריכות להיות אפויות אבל לא זהובות. מעבירים את העוגיות לרשת, לצינון.", "מחלקים את העוגיות לצמדים. מניחים כפית ריבת חלב על עוגיה ומכסים בעוגיה נוספת. מגלגלים את השוליים בשבבי הקוקוס. העוגיות יישמרו בכלי אטום עד שבוע."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cookie6.jpg",
                    Rshow =true
                },
                new Recipe()
                {
                    Rname ="עוגיות שוקולד מושחתות",
                    Rcategory =categoryList[1],
                    Rtimer =40,
                    Rlevel =3,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "300 גרם שוקולד מריר", "50 גרם חמאה", "3 ביצים", "1 כוס סוכר", "2 כפות שטוחות קמח מצה", "2 כפות שטוחות קמח תפוחי אדמה", "1/4 כפית אבקת אפייה", "1/4 כפית מלח", "1 כוס אגוזי מלך קצוצים גס", "1 כוס שוקולד צ'יפס"},
                    Rpreparation =new List<string>(){ " מחממים תנור ל-180 מעלות.", " במיקרוגל ממיסים יחד שוקולד וחמאה.", "בקערה גדולה טורפים במטרפה ידנית ביצים וסוכר במשך דקה-שתיים, עד שהתערובת אחידה וקצת מגדילה את נפחה.", "מוסיפים לתערובת הביצים את תערובת השוקולד ומערבבים היטב. מוסיפים קמח מצה, קמח תפוחי אדמה, אבקת אפייה ומלח וטורפים לקבלת תערובת אחידה. מערבבים פנימה אגוזים ושוקולד צ'יפס.", "מניחים גבעות מהתערובת באופן מרווח על תבנית מרופדת בנייר אפייה (הכי נוח בעזרת כף גלידה קפיצית. אם אין אז ב-2 כפות רגילות). התערובת תשתטח לשלוליות גדולות וזה בסדר.", "אופים 10-12 דקות, עד שהעוגיות סדוקות ומבריקות. הן אמורות לצאת מהתנור כשהן עדיין רכות (העוגיות יתייצבו במהלך הקירור). רק אחרי שהעוגיות התקררו לגמרי משחררים אותן בעדינות מנייר האפייה ומגישים. שומרים בכלי אטום בטמפרטורת החדר."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cookie7.jpg",
                    Rshow =true
                },
              
                new Recipe()
                {
                    Rname ="עוגת וניל בחושה",
                    Rcategory =categoryList[0],
                    Rtimer =10,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){  "1/4 כוס מים", "1 כף חומץ", "כפית סודה לשתיה", "1/3 כוס שמן", "1/4 כוס סוכר", "קורט מלח", "1 כוס (140 גרם) קמח תופח"},
                    Rpreparation =new List<string>(){ "טורפים בקערה את כל המרכיבים למעט הקמח לעיסה אחידה. מוסיפים קמח ומערבבים לעיסה אחידה ולא יותר (נמנעים מערבוב יתר).", "מעבירים לתבנית משומנת ואופים בתנור שחומם מראש ל 170 מעלות כ 30 דקות, עד שקיסם הננעץ במרכז העוגה יוצא יבש. מצננים, בוזקים אבקת סוכר ומגישים."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cake1.jpg",
                    Rshow =true
                },
                 new Recipe()
                {
                    Rname ="עוגות תות וניל אישיות",
                    Rcategory =categoryList[0],
                    Rtimer =40,
                    Rlevel =4,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "120 גרם חמאת תנובה, מומסת", "¾ כוס (150 גרם) סוכר", "חצי גביע (100 גרם) שמנת חמוצה 15% תנובה", "2 ביצים", "כפית תמצית וניל", "כוס וחצי (210 גרם) קמח", "חצי כפית מלח", "כפית וחצי אבקת אפייה", "חצי כפית סודה לשתיה", "6 תותים ללא העוקץ","1 מיכל שמנת להקצפה 38% "+"השף הלבן","200 גרם שוקולד לבן"},
                    Rpreparation =new List<string>(){ " להכנת הקרם, ממיסים את השמנת המתוקה והשוקולד הלבן ומעבירים לקירור למשך 4 שעות לפחות. ", " להכנת המאפינס, בקערה בינונית טורפים את החמאה והסוכר. מוסיפים את השמנת החמוצה, הביצים, הוניל וטורפים היטב. בקערה קטנה, מנפים את הקמח, המלח, אבקת האפייה ואבקת הסודה לשתייה. מאחדים בין תערובת הקמח לתערובת הנוזלים ומערבבים רק עד לקבלת תערובת אחידה.", " מעבירים את הבלילה לתבניות מאפינס אישיות גבוהות מקרטון, וממלאים עד ל-3/4 גובה. אופים את העוגות כ-30-40 דקות, או עד שקיסם הננעץ בהן יוצא יבש עם פירורים לחים. מצננים לחלוטין.", "להכנת הקרם, מעבירים את גנאש השוקולד לקערת מיקסר עם בלון הקצפה ומקציפים לקרם יציב. מעבירים את הקרם לשקית זילוף עם צנטר משונן. בעזרת סכין, עושים חור גדול ועמוק בכל עוגה, מזלפים מעט קרם ומניחים בפנים תות שלם. מזלפים מעל עוד מקרם השוקולד הלבן ומגישים. אם מעבירים אח"+"כ לקירור, מומלץ להוציא את העוגה מהמקרר כחצי שעה לפני ההגשה."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cake2.jpg",
                    Rshow =true
                },
                  new Recipe()
                {
                    Rname ="עוגת שיש עם קרם פרש",
                    Rcategory =categoryList[0],
                    Rtimer =40,
                    Rlevel =2,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "½ כוס (125 מל) שמן", "1 כוס (200 גרם) סוכר", "2 ביצים גדולות", "2 כוסות (250 גרם) קמח", "2 כפיות אבקת אפייה", "קורט מלח", "1 גביע (200 גרם) קרם פרש", "½ כוס (125 מ'ל) חלב ","1 כפית תמצית וניל", "½ כפית הל טחון", "60 גרם שוקולד מריר 60% מומס", "1 כפית אבקת קקאו", "2 כפות וויסקי", "½ כוס ממרח קקאו אגוזים", "½ כוס אגוזי לוז מולבנים קצוצים", "1 כף סוכר חום", "2 קוביות שוקולד מריר מרוסקות או מגוררות"},
                    Rpreparation =new List<string>(){ ". מרפדים תבנית מוארכת עמוקה 30x10 ס'מ בנייר אפייה. מחממים את התנור לחום בינוני (180 מעלות בחום עליון־תחתון; 160 מעלות בתוכנית טורבו).","מערבלים את השמן עם הסוכר ועם הביצים עד שהסוכר נמס. מנפים פנימה קמח, אבקת אפייה ומלח, מוסיפים חצי גביע (100 גרם) קרם פרש וחלב ומערבלים רק עד שהתערובת כמעט אחידה. מעבירים שליש מהתערובת לקערה שנייה. מוסיפים לקערת הערבול תמצית וניל והל ומערבלים רק עד שהתערובת חלקה. מוסיפים לקערה השנייה שוקולד מומס, אבקת קקאו ו־2 כפות וויסקי ומערבלים רק עד שהתערובת חלקה.", "יוצקים את התערובת הבהירה לתבנית. יוצקים עליה את תערובת השוקולד. מערבבים קצת בלהב סכין כדי ליצור דוגמת שיש. מערבבים את ממרח הקקאו אגוזים (נוטלה או ממרח דומה. אם הוא נוקשה מדי לערבוב, מרככים אותו במיקרוגל) עם הקרם פרש הנותר, מעבירים לשקיק זילוף קטן ומזלפים פסים עבים על העוגה. מערבבים שוב בלהב סכין כדי לשייש את הקרם לתוך תערובת העוגה. ", "מערבבים יחד את חומרי הציפוי וזורים על העוגה. אופים במדף האמצעי של התנור במשך 60-55 דקות, עד שקיסם שננעץ במרכז העוגה יוצא כמעט נקי."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cake3.jpg",
                    Rshow =true
                },
                   new Recipe()
                {
                    Rname ="עוגת קינמון בציפוי שוקולד וקרמל מלוח",
                    Rcategory =categoryList[0],
                    Rtimer =20,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "100 גרם חמאה בטמפרטורת החדר", "¼1 כוסות (250 גרם) סוכר", "1 כפית קליפת תפוז מגוררת", "⅓ כוס (80 מ'ל) שמן ", "3 ביצים גדולות", "½2 כוסות (310 גרם) קמח", "¾ כפית אבקת אפייה", "¼ כפית אבקת סודה לשתייה", "2 כפיות קינמון טחון", "½1 כפיות גרגרים/אבקה של קפה נמס", "¾ כוס (180 מ'ל) מים פושרים", "3 גביעים יולו שוקולד לבן וחלב בטעם קרמל מלוח", "1 גביע יולו שוקולד לבן"},
                    Rpreparation =new List<string>(){ " מחממים את התנור לחום בינוני (180 מעלות בחום עליון־תחתון; 160 מעלות בתוכנית טורבו). משמנים תבנית מלבנית 23x30 ס'מ, ומרפדים את תחתיתה ואת דופנותיה בנייר אפייה.", "בקערה גדולה מערבלים את החמאה עם הסוכר ועם הקליפה המגוררת לתערובת אוורירית. מוסיפים את השמן בהדרגה תוך ערבול. מוסיפים ביצים וקמח מנופה עם אבקת אפייה, אבקת סודה וקינמון. ממסים את הקפה במים הפושרים ומוסיפים לקערה. מערבלים במשך כדקה לתערובת חלקה. מעבירים לתבנית, מיישרים את פני התערובת, ואופים במרכז התנור במשך 35-30 דקות, עד ששולי העוגה נפרדים מהדפנות ומרכז העוגה יבש קפיצי למגע. מוציאים מהתנור ומצננים.", "מפזרים על פני העוגה כפיות מלאות של יולו שוקולד לבן וחלב - לוקחים מכל השכבות יחד - ושל יולו לבן. בחוד סכין מאחדים את גושי היולו ומסלסלים אותם זה לתוך זה כדי ליצור דוגמת שיש. מקררים במשך שעה לפחות לפני ההגשה, כדי להניח לעוגה לספוג לתוכה מעט מהלחות של ציפוי היולו. להגשה, חותכים לריבועים בגודל הרצוי."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cake4.jpg",
                    Rshow =true
                },
                    new Recipe()
                {
                    Rname ="עוגת אגוזים ושקדים עם שוקולד",
                    Rcategory =categoryList[0],
                    Rtimer =20,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "6 ביצים", "1 כוס סוכר", "1 חבילה שוקולד מריר מגורד", "200 גרם שקדים טחונים", "100 גרם אגוזים טחונים", "1 כף תמצית וניל", "1 כף ברנדי", "1 כף מיץ לימון", "1 כף קמח מצה", "2-3 כפות ריבה", "1 כוס שמנת מתוקה להקצפה", "2 כפות סוכר"},
                    Rpreparation =new List<string>(){ "מקציפים את הביצים עם הסוכר במערבל במהירות גבוהה, עד שהתערובת מסמיכה ומקבלת גוון בהיר כ- 10 דקות.", "מוסיפים בבחישה מתמדת בכף עץ את השוקולד, השקדים, האגוזים, תמצית הווניל, הברנדי והלימון.", "מוסיפים את הקמח מצה.", "שמים בתבנית משומנת ומקומחת מעט, ואופים כ 35 דקות בחום בינוני. מוציאים ומקררים.", ".מורחים ריבה. מקציפים את השמנת עם 2 כפות סוכר ומורחים על הריבה. מקשטים באגוזים והשוקולד. "},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cake5.jpg",
                    Rshow =true
                },
                     new Recipe()
                {
                    Rname ="עוגת תפוזים אוורירית",
                    Rcategory =categoryList[0],
                    Rtimer =20,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "4 ביצים גדולות", "1 כוס סוכר", "1 כפית תמצית וניל", "קורט מלח", "1 מיכל יוגורט עיזים פיראוס", "גרידה משני תפוזים", "3/4 כוס מיץ תפוזים סחוט טרי", "3/4 כוס שמן", "2 וחצי כוסות קמח", "1 שקית אבקת אפייה", "מעט אבקת סוכר לקישוט"},
                    Rpreparation =new List<string>(){ " מחממים תנור ל-180 מעלות.", "מקציפים יחד ביצים, סוכר, וניל ומלח במשך כ-4-5 דקות במהירות גבוהה מאוד, עד שמתקבלת תערובת אוורירית ואחידה.", "מוסיפים פנימה יוגורט עיזים, גרידה, מיץ תפוזים ושמן בזרם דק, וממשיכים להקציף במהירות בינונית-נמוכה, עד שכל המרכיבים נטמעים בתערובת.", "מנפים פנימה קמח ואבקת אפייה ומערבבים בעדינות רק עד שאחיד.", " יוצקים את התערובת ל-2 תבניות אינגליש קייק משומנות ואופים במשך כ-35-45 דקות, או עד שקיסם הננעץ במרכז העוגות יוצא עם פירורים לחים.", " מצננים לחלוטין, מקשטים באבקת סוכר ומגישים."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cake6.jpg",
                    Rshow =true
                },
                      new Recipe()
                {
                    Rname ="עוגת שיש בחושה",
                    Rcategory =categoryList[0],
                    Rtimer =20,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){  "2 גביעי שמנת/יוגורט", "3 כוסות קמח", "1 ו-1/2 כוסות סוכר", "2 כפיות אבקת אפייה", "2 כפיות סוכר וניל", "3 ביצים", "3/4 כוס שמן"},
                    Rpreparation =new List<string>(){ "מערבבים את כל המרכיבים בקערה לכדי עיסה, שופכים את רוב העיסה לתבנית עגולה מספר 26, ומשאירים מעט בקערה", "לעיסה שנשארה בקערה מוסיפים כף או שתיים של קקאו ומערבבים.", " שופכים על העוגה ומערבבים ברפרוף, בעדינות עם מזלג.", " אופים בתנור בחום בינוני של 180 מעלות."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cake7.jpg",
                    Rshow =true
                },
               
                   new Recipe()
                {
                    Rname ="עוגיות תפוזים ושוקולד לבן",
                    Rcategory =categoryList[1],
                    Rtimer =25,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){ "100גרם חמאה רכה", "45גרם סוכר לבן","45גרם סוכר חום בהיר דמררה","1/2תפוז בינוני","1ביצה L","1כף תמצית וניל","130גרם קמח לבן","2גרם אבקת סודה לשתייה","80גרם שוקולד לבן"},
                    Rpreparation =new List<string>(){  "מחממים תנור לחום של 170 מעלות.", "במיקסר עם וו גיטרה מעבדים את החמאה, הסוכרים, המלח וגרידת התפוז עד שנוצרת תערובת תפוחה ובהירה.","מוסיפים את הביצה ותמצית הוניל ומעבדים עד לאיחוד.","מנמיכים את מהירות המיקסר ומוסיפים את הקמח והסודה לשתייה.","מערבבים מעט ומוסיפים את השוקולד הלבן. ממשיכים לעבד עד לאיחוד.","מצננים במידת הצורך את התערובת ויוצרים 18 כדורים.","אופים בתנור שחומם מראש כ-13 דקות עד שמזהיב מעט.","מוציאים מהתנור ונותנים לעוגיות להצטנן. מומלץ להעביר למקרר ל-15 דקות לפני זילוף השוקולד."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cookie8.jpg",
                    Rshow =true
                },
                   new Recipe()
                {
                    Rname ="ביסקוטי וניל עם פקאן ופצפוצי שוקולד",
                    Rcategory =categoryList[1],
                    Rtimer =25,
                    Rlevel =1,
                    Rdate =new DateTime(2019,12,12),
                    Ringredients =new List<string>(){"500גרם או 3 1/2כוסות קמח לבן","2כפיות אבקת אפייה", "1/2כפית אבקת סודה לשתייה","1/2כפית מלח דק","4ביצים L","300גרם או 1 1/2כוסות סוכר לבן","2שקיות סוכר וניל","3כפות ברנדי","200גרם או 2כוסות אגוזי פקאן","1כוס שוקולד צ’יפס"},
                    Rpreparation =new List<string>(){ "מחממים תנור ל-170 מעלות.", "מערבבים בקערה קמח, אבקת אפייה, אבקת סודה לשתייה ומלח.", "בקערה נפרדת טורפים ביצים, סוכר, סוכר וניל וברנדי. יוצקים את תערובת הביצים לקערה עם תערובת הקמח ולשים בידיים רק עד לקבלת בצק אחיד ודביק מאוד.","מוסיפים פקאנים ושוקולד צ’יפס ולשים קצרות לפיזורם האחיד בבצק.","בידיים נקיות ורטובות יוצרים מהבצק 2 “נקניקים” שמנמנים באורך כ-30 ס”מ, מניחים על תבנית מרופדת בנייר אפייה ומשטחים בידיים מעט.","אופים כ-30 דקות, עד שהכיכרות מוצקות למגע אך עדיין מעט רכות ללחיצה. מצננים לחלוטין (אחרת השוקולד יימרח במהלך הפריסה).","מחממים תנור ל-140 מעלות.","בסכין ארוכה פורסים באלכסון ארוך ככל האפשר, לפרוסות בעובי 1 ס”מ. מניחים את הפרוסות על רשת התנור ואופים כ-25 דקות, עד שהעוגיות יבשות למגע. מצננים לחלוטין ושומרים בצנצנת גבוהה ואטומה."},
                    RUcode =userList[0].Ucode,
                    Rpicture ="assets/cookie9.jpg",
                    Rshow =true
                },
                 








            };
        }
    

        
    }
}